fonecmid-diplom/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ВКМ_МассовоеСозданиеАктов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВКМ_МассовоеСозданиеАктов</name>
  <attributes>
    <name>Период</name>
    <type>
      <types>StandardPeriod</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Договоры</name>
    <attributes>
      <name>ДоговорКонтрагента</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>РеализацияПоДоговору</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

fonecmid-diplom/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/Forms/Форма/Module.bsl
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Заполнить(Команда)
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОповещениеОЗавершении", ЭтотОбъект);
	ДлительнаяОперация = ЗаполнитьНаСервере();
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания); 
	
КонецПроцедуры 

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ЗаполнитьНаСервере()
	
	СтруктураПериодМассивАктов = Новый Структура;
	СтруктураПериодМассивАктов.Вставить("Период", Объект.Период); 
	
	ДлительнаяОперация = ДлительныеОперации.ВыполнитьФункцию(УникальныйИдентификатор, "Обработки.ВКМ_МассовоеСозданиеАктов.ВыполнитьМассовоеСозданиеАктов", СтруктураПериодМассивАктов);
	
	ТЗВыборка = Обработки.ВКМ_МассовоеСозданиеАктов.ВыполнитьМассовоеСозданиеАктов(СтруктураПериодМассивАктов);
	Для каждого Строка Из ТЗВыборка Цикл
		СтрокаТЧ = Объект.Договоры.Добавить();
		СтрокаТЧ.ДоговорКонтрагента = Строка.Договор;
		СтрокаТЧ.РеализацияПоДоговору = Строка.СсылкаРеализация;
		Если Не ЗначениеЗаполнено(СтрокаТЧ.РеализацияПоДоговору) Тогда
			НоваяРеализация = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
			НоваяРеализация.Дата = ТекущаяДата();
			НоваяРеализация.Договор = Строка.Договор;
			НоваяРеализация.Заполнить(Строка.ЗаказПокупателя);
			НоваяРеализация.ВыполнитьАвтозаполнение();
			НоваяРеализация.ПроверитьЗаполнение();
			НоваяРеализация.Записать();
			СтрокаТЧ.РеализацияПоДоговору = НоваяРеализация.Ссылка;
			НоваяРеализация.Записать(РежимЗаписиДокумента.Проведение);
		КонецЕсли;	
	КонецЦикла;
	
	Возврат ДлительнаяОперация;
	
КонецФункции 

&НаКлиенте
Процедура ОповещениеОЗавершении(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат.Статус = "Выполнено" Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Загрузка завершена.";
		Сообщение.Сообщить();
	КонецЕсли
	
КонецПроцедуры

#КонецОбласти
